billing_cf/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

billing_cf/CommonModules/бестПроверкаДанныхКонтрагентаСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Если возвращается ложь то данного Договор не заключен, или он закрыт! 
// Если возвращается истина то данный Договор заключен!
#Область ОбработчикиСобытий
Функция ДоговорЗаключен(Дата, Организация, Район, Договор) ЭКСПОРТ
	ДоговорЗаключен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестСостояниеДоговоровСрезПоследних.Состояние КАК Состояние,
	|	бестСостояниеДоговоровСрезПоследних.Организация КАК Организация,
	|	бестСостояниеДоговоровСрезПоследних.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	РегистрСведений.бестСостояниеДоговоров.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Договор = &Договор
	|				И Район = &Район) КАК бестСостояниеДоговоровСрезПоследних
	|ГДЕ
	|	бестСостояниеДоговоровСрезПоследних.Состояние
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСостояниеДоговоровСрезПоследних.Состояние,
	|	бестСостояниеДоговоровСрезПоследних.Договор,
	|	бестСостояниеДоговоровСрезПоследних.Организация";
	
	Запрос.УстановитьПараметр("Дата",			Дата);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("Договор",		Договор);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоговорЗаключен = Выборка.Состояние;
	КонецЦикла;
	
	Возврат ДоговорЗаключен;
КонецФункции

// Возвращает Точку Учета и подключенную к ней услугу.
Функция СостояниеУслугиТочкиУчета(Дата,Район,Абонент,ТочкиУчета) ЭКСПОРТ	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
		|ПОМЕСТИТЬ ВТ_ПодключенныеТУ
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(&Дата, ТочкаУчета.Наименование В (&Наименование)) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргУслугиТочекУчетаСрезПоследних.Абонент,
		|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|			&Дата,
		|			Абонент = &Абонент
		|				И Район = &Район
		|				И ТочкаУчета В
		|					(ВЫБРАТЬ
		|						ВТ_ПодключенныеТУ.ТочкаУчета
		|					ИЗ
		|						ВТ_ПодключенныеТУ КАК ВТ_ПодключенныеТУ)) КАК энргУслугиТочекУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Район", Район);
	
	НаименованиеТУ = новый ТаблицаЗначений;
	НаименованиеТУ.Колонки.Добавить("Наименование");
	Для Каждого Строка из ТочкиУчета Цикл
		СтрокаНаименованияТУ = НаименованиеТУ.Добавить();		
		СтрокаНаименованияТУ.Наименование = Строка.НаименованиеТочки;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеТУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	
	// Если результат пустой значит услуги не найдены и проверку на услуги ТУ прошла! 
	// Иначе если найдены услуги подключенные к ТУ, то ТУ не прошла проверку! возвращаем ТЗ с данными о услуге и ТУ!
	
	ТУИУслуга = новый СписокЗначений;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Стр 		= ТУИУслуга.Добавить();
		// Стр.ТУ 		= ВыборкаДетальныеЗаписи.ТочкаУчета;
		// Стр.Услуга 	= ВыборкаДетальныеЗаписи.Услуга;
		ТУИУслуга.Добавить(ВыборкаДетальныеЗаписи.ТочкаУчета,ВыборкаДетальныеЗаписи.Услуга);
		// ТУИУслуга.Добавить(ВыборкаДетальныеЗаписи.Услуга,"Услуга");		
	КонецЦикла;	
	
	Возврат ТУИУслуга;
КонецФункции

// Если возвращается ложь то ПУ выключен! 
// Если возвращается истина то данный ПУ подключен!
// Если ПроверкаТочек = истина значит  проверяем точку на наличие прибора.  
Функция СостояниеПрибораУчета(Дата,Абонент,ЗаводскойНомер,ТипПУ,ПроверкаТочки = Ложь, ТочкаУчета = Неопределено) ЭКСПОРТ
	
	Подключен = Ложь;	 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета,
	|	энргАктивностьТочекУчетаСрезПоследних.Абонент
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(&Дата, Абонент В (&Абонент)) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.ЭнргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета КАК ПУ
	|ИЗ
	|	РегистрСведений.энргПриборыТочекУчета.СрезПоследних(
	|			&Дата,
	|			ТочкаУчета В
	|				(ВЫБРАТЬ
	|					ВТ_ТУ.ТочкаУчета
	|				ИЗ
	|					ВТ_ТУ КАК ВТ_ТУ)) КАК энргПриборыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета.Наименование = &Наименование
	|	И энргПриборыТочекУчетаСрезПоследних.ПриборУчета.ТипПрибораУчета = &ТипПУ";
	
	Если ПроверкаТочки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргПриборыТочекУчетаСрезПоследних.ПриборУчета.Наименование = &Наименование","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргПриборыТочекУчетаСрезПоследних.ПриборУчета.ТипПрибораУчета = &ТипПУ","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Абонент В (&Абонент)","Абонент В (&Абонент) И ТочкаУчета В (&ТочкаУчета)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.ЭнргСостояниеТочекУчета.Включена)","ГДЕ   энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.ЭнргСостояниеТочекУчета.Включена)");
		Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Наименование", ЗаводскойНомер);
	Запрос.УстановитьПараметр("ТипПУ", ТипПУ);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ПУ <> Справочники.энргПриборыУчетаАбонента.ПустаяСсылка() Тогда
			Подключен = Истина; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Подключен;
	
КонецФункции

Функция ПараметрыТочекУчета(ТочкиУчета) ЭКСПОРТ
	Параметры  		= Новый Структура;
	МассивТочек  	= Новый Массив;	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ТочкиУчета",ТочкиУчета);
	Запрос.Текст 	= "ВЫБРАТЬ
	|	ТочкиУчета.НомерСтроки
	|ПОМЕСТИТЬ ДанныеТУ
	|ИЗ
	|	&ТочкиУчета КАК ТочкиУчета
	|ГДЕ
	|	ТочкиУчета.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТУ.НомерСтроки
	|ИЗ
	|	ДанныеТУ КАК ДанныеТУ";
	Результат  		= Запрос.Выполнить();
	Параметры.Вставить("НужноСоздаватьТочкиУчета", Не Результат.Пустой());	
	Выборка  		= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		МассивТочек.Добавить(Выборка.НомерСтроки);
	КонецЦикла;	
	Параметры.Вставить("МассивТочек",МассивТочек);
	Возврат Параметры;
КонецФункции

Функция ПараметрыПриборовУчета(ТочкиУчета) ЭКСПОРТ
	Параметры  		= Новый Структура;
	МассивТочек  	= Новый Массив;	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ТочкиУчета",ТочкиУчета);
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ТочкиУчета.НомерСтроки
	             	  |ПОМЕСТИТЬ ДанныеПУ
	             	  |ИЗ
	             	  |	&ТочкиУчета КАК ТочкиУчета
	             	  |ГДЕ
	             	  |	ТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	             	  |	И ТочкиУчета.ЗаводскойНомер <> """"
	             	  |	И ТочкиУчета.КоэффициентПУ >= 1
	             	  |	И ТочкиУчета.ДатаПоверкиСчетчика <> """"
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ДанныеПУ.НомерСтроки
	             	  |ИЗ
	             	  |	ДанныеПУ КАК ДанныеПУ";
	Результат  		= Запрос.Выполнить();
	Параметры.Вставить("НужноСоздаватьПриборыУчета", Не Результат.Пустой());	
	Выборка  		= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		МассивТочек.Добавить(Выборка.НомерСтроки);
	КонецЦикла;	
	Параметры.Вставить("МассивПриборов",МассивТочек);
	Возврат Параметры;
КонецФункции

// Если ПроверкаНаНаличие = истина Тогда проверяется наличие данной точки учета!
// Иначе проверяем состояние ТУ уже имеющейся!
Функция СостояниеТУ(Дата,Абонент,Район,ТочкаУчета)  Экспорт 	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета,
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|			&Дата,
	|			Абонент = &Абонент
	|				И Район = &Район
	|				И ТочкаУчета В (&Точки)) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)";
	
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Точки", ТочкаУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТУИСостояние = новый СписокЗначений;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТУИСостояние.Добавить(ВыборкаДетальныеЗаписи.ТочкаУчета,ВыборкаДетальныеЗаписи.Состояние);
	КонецЦикла; 
	
	
	Возврат ТУИСостояние;
КонецФункции

Функция СостояниеМКД (Дата,Район,МКД)Экспорт
	Открыт = Ложь; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргСостояниеМКДСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.энргСостояниеМКД.СрезПоследних(
	|			&Дата,
	|			МКД = &МКД
	|				И Район = &Район) КАК энргСостояниеМКДСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МКД", МКД);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Открыт = ВыборкаДетальныеЗаписи.Состояние;
	КонецЦикла;
	
	
	Возврат Открыт;
КонецФункции

Функция ЕстьОткрытыеЛСВМКД(Период,Район,МКД) Экспорт  
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Период" ,Период);
	Запрос.УстановитьПараметр("Район" ,Район);
	Запрос.УстановитьПараметр("МКД" ,МКД);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргАбоненты.Ссылка
	|ПОМЕСТИТЬ ВсеАбонентыМКД
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|ГДЕ
	|	энргАбоненты.Район = &Район
	|	И энргАбоненты.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Абонент
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&Период,
	|			Район = &район
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВсеАбонентыМКД.Ссылка
	|					ИЗ
	|						ВсеАбонентыМКД КАК ВсеАбонентыМКД)) КАК энргСостояниеЛССрезПоследних";
	Результат  = Запрос.Выполнить();
	Возврат не Результат.Пустой();
	
КонецФункции

Функция ПроверитьДолгАбонента (Дата,Абонент,Район,МКД) ЭКСПОРТ
	ЕстьДолг = Ложь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(энргВзаиморасчетыОстатки.СуммаОстаток, 0) КАК Долг
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты.Остатки(
		|			&Дата,
		|			Абонент = &Абонент
		|				И МКД = &МКД
		|				И Район = &Район) КАК энргВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МКД", МКД);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Долг > 0 Тогда
			ЕстьДолг = Истина;
		КонецЕсли;
		
	КонецЦикла;	
		
	Возврат ЕстьДолг
КонецФункции

#КонецОбласти

#КонецОбласти
